[
  { "site":"Wix", "image":"static/images/wix.png", "details":"Wix is a website builder, an easy-to-use tool that lets you quickly create an online presence via drag-and-drop interface—no coding or FTP knowledge is required. All you need is an email address to get started with Wix's web hosting. In fact, if you don't mind the advertisements, you can spin up a site for free." },
  { "site":"HubSpot", "image":"https://www.hubspot.com/hubfs/assets/hubspot.com/style-guide/brand-guidelines/guidelines_the-logo.svg", "details":"HubSpot CMS Hub is a fully integrated content management system that is specifically designed for marketers and business owners. Because it is built on top of HubSpot’s CRM platform which includes all sorts of marketing automation, sales, service, and operations tools, CMS Hub is an ideal solution for growing businesses as well as large enterprises looking for an all-in-one system to manage their website." },
  { "site":"Shopify", "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Flogos-world.net%2Fshopify-logo%2F&psig=AOvVaw2xiW3XM1gSh0n5ATumug0T&ust=1637082169280000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCKj4g8jsmvQCFQAAAAAdAAAAABAD", "details":"Shopify is a subscription-based software that allows anyone to set up an online store and sell their products. Shopify store owners can also sell in physical locations using Shopify POS, our point-of-sale app and accompanying hardware. If you’re a Shopify merchant with both an online and physical presence, your inventory and stock get synced so you can manage your store(s) from one account, on any device." },
  { "site":"Waxing Gibbous", "image":"https://moon.nasa.gov/internal_resources/365", "details":"Now most of the Moon’s dayside has come into view, and the Moon appears brighter in the sky." },
  { "site":"Full Moon", "image":"https://moon.nasa.gov/internal_resources/364", "details":"This is as close as we come to seeing the Sun’s illumination of the entire day side of the Moon (so, technically, this would be the real half moon). The Moon is opposite the Sun, as viewed from Earth, revealing the Moon’s dayside. A full moon rises around sunset and sets around sunrise. The Moon will appear full for a couple of days before it moves into…" },
  { "site":"Waning Gibbous", "image":"https://moon.nasa.gov/internal_resources/363", "details":"As the Moon begins its journey back toward the Sun, the opposite side of the Moon now reflects the Moon’s light. The lighted side appears to shrink, but the Moon’s orbit is simply carrying it out of view from our perspective. The Moon rises later and later each night." },
  { "site":"Last Quarter", "image":"https://moon.nasa.gov/internal_resources/362", "details":"The Moon looks like it’s half illuminated from the perspective of Earth, but really you’re seeing half of the half of the Moon that’s illuminated by the Sun ― or a quarter. A last quarter moon, also known as a third quarter moon, rises around midnight and sets around noon." },
  { "site":"Waning Crescent", "image":"https://moon.nasa.gov/internal_resources/361", "details":"The Moon is nearly back to the point in its orbit where its dayside directly faces the Sun, and all that we see from our perspective is a thin curve." }
]