[
  { "site":"Wix", 
    "image":"static/images/wix.png",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"Wix is a website builder, an easy-to-use tool that lets you quickly create an online presence via drag-and-drop interface—no coding or FTP knowledge is required. All you need is an email address to get started with Wix's web hosting. In fact, if you don't mind the advertisements, you can spin up a site for free." },
  
  { "site":"HubSpot", 
    "image":"static/images/hubspot.svg",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"HubSpot CMS Hub is a fully integrated content management system that is specifically designed for marketers and business owners. Because it is built on top of HubSpot’s CRM platform which includes all sorts of marketing automation, sales, service, and operations tools, CMS Hub is an ideal solution for growing businesses as well as large enterprises looking for an all-in-one system to manage their website." },
 
  { "site":"Shopify", 
    "image":"static/images/shopify.png",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"Shopify is a subscription-based software that allows anyone to set up an online store and sell their products. Shopify store owners can also sell in physical locations using Shopify POS, our point-of-sale app and accompanying hardware. If you’re a Shopify merchant with both an online and physical presence, your inventory and stock get synced so you can manage your store(s) from one account, on any device." },
 
  { "site":"", 
    "image":"",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"" },

  { "site":"", 
    "image":"",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"" },
 
  { "site":"", 
    "image":"",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"" },
  
  { "site":"", 
    "image":"",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"" },
  
  { "site":"", 
    "image":"",
    "produced": "",
    "tech": "",
    "pros": "",
    "cons": "",
    "details":"" }
]